RezaAbbaszadeh/Smart-House-STM32CUBEMX-KEIL/Src/main.c
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2021 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"

/* USER CODE BEGIN Includes */
#include "LiquidCrystal.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc4;

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart2;

PCD_HandleTypeDef hpcd_USB_FS;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_USB_PCD_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM3_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_ADC4_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
	void numberToBCD(int i){
		int x1 = i&1;
		int x2 = i&2;
		int x3 = i&4;
		int x4 = i&8;
		
		HAL_GPIO_WritePin(GPIOC,GPIO_PIN_0,x1 > 0);
		HAL_GPIO_WritePin(GPIOC,GPIO_PIN_1,x2 > 0);
		HAL_GPIO_WritePin(GPIOC,GPIO_PIN_2,x3 > 0);
		HAL_GPIO_WritePin(GPIOC,GPIO_PIN_3,x4 > 0);
	}
	
	void turnOff7seg(){
		HAL_GPIO_WritePin(GPIOF,GPIO_PIN_9| GPIO_PIN_10,1);
		HAL_GPIO_WritePin(GPIOC,GPIO_PIN_13,1);
		HAL_GPIO_WritePin(GPIOE,GPIO_PIN_6,1);
		HAL_GPIO_WritePin(GPIOB,GPIO_PIN_2,0);
		
	}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_USB_PCD_Init();
  MX_USART2_UART_Init();
  MX_TIM3_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_ADC4_Init();
  /* USER CODE BEGIN 2 */
	LiquidCrystal(GPIOD, GPIO_PIN_6, GPIO_PIN_5, GPIO_PIN_4, GPIO_PIN_3, GPIO_PIN_2, GPIO_PIN_1, GPIO_PIN_0);
	begin(20, 4);
	setCursor(0,0);
	
	// Keypad
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_9, 1);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10, 1);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_11, 1);

	// PWMs
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);
	
	// ADCs
	HAL_ADC_Start_IT(&hadc1);
	HAL_ADC_Start_IT(&hadc2);
	HAL_ADC_Start_IT(&hadc4);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	int brightness = 0;
  while (1)
  {
//		turnOff7seg();
//			HAL_GPIO_WritePin(GPIOF, GPIO_PIN_9, 0);
//		numberToBCD(2);
//		
//		HAL_Delay(3);
//		
//		turnOff7seg();
//			HAL_GPIO_WritePin(GPIOF, GPIO_PIN_10, 0);
//		numberToBCD(5);
//		HAL_GPIO_WritePin(GPIOB,GPIO_PIN_2,1);
//		
//		HAL_Delay(3);
//		
//		turnOff7seg();
//			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 0);
//		numberToBCD(8);
//		
//		HAL_Delay(3);
//		
//		turnOff7seg();
//			HAL_GPIO_WritePin(GPIOE, GPIO_PIN_6, 0);
//		numberToBCD(1);
//		
//		HAL_Delay(3);

//		__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, brightness);
//		__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, brightness);
//		__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, brightness);
//		__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, brightness);
//		
//		brightness = (brightness+10)%100;
//		HAL_Delay(100);
  /* USER CODE END WHILE */

